CSI API ETABS v1
cDCoSP63133302011.SetOverwrite Method
 Sets the value of a concrete design overwrite item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOverwrite(
	string Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType.Objects
)
Function SetOverwrite (
	Name As String,
	Item As Integer,
	Value As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDCoSP63133302011
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetOverwrite(Name,
	Item, Value, ItemType)
int SetOverwrite(
	String^ Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType::Objects
)
abstract SetOverwrite :
        Name : string *
        Item : int *
        Value : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
Item
Type: System.Int32
 This is an integer between 1 and 22, inclusive, indicating the overwrite item considered.
Framing type (beams and columns)
Live load reduction factor (beams and columns)
Unbraced length ratio, Major (beams and columns)
Unbraced length ratio, Minor (beams and columns)
Effective length factor, K Major (columns only)
Effective length factor, K Minor (columns only)
Moment amplification factor, Eta Major (columns only)
Moment amplification factor, Eta Minor (columns only)
Gammab3 for column (columns only)
Gammab3 for beam (beams only)
Consider torsion (beams only)
(qsw,1*Z1)/(Rs*As,1) (beams only)
Corner rebar fraction top (beams only)
Corner rebar fraction bottom (beams only)
Consider minimum eccentricity (columns only)
Consider crack analysis (beams only)
Crack width limit full load, a_crc,ult [mm] (beams only)
Crack width limit long term, a_crc,l,ult [mm] (beams only)
Longitudinal rebar size top (beams only)
Longitudinal rebar size bottom (beams only)
Ignore beneficial Pu for beam design (beams only)
Is longitudinal rebar ribbed (beams only)
Value
Type: System.Double
 The value of the considered overwrite item.
 Framing type
0 = Program Default
1 = Sway
2 = NonSway
 Live load reduction factor
 Value >= 0; 0 means use program determined value
 Unbraced length ratio, Major
 Value >= 0; 0 means use program determined value
 Unbraced length ratio, Minor
 Value >= 0; 0 means use program determined value
 Effective length factor, K Major
 Value >= 0; 0 means use program determined value
 Effective length factor, K Minor
 Value >= 0; 0 means use program determined value
 Moment amplification factor, Eta Major
 Value >= 0; 0 means use program determined value
 Moment amplification factor, Eta Minor
 Value >= 0; 0 means use program determined value
 Gammab3 for column
 Value >= 0; 0 means use program determined value
 Gammab3 for beam
 Value >= 0; 0 means use program determined value
 Consider torsion
0 = No
Any other value = Yes
 (qsw,1*Z1)/(Rs*As,1)
 Value >= 0; 0 means use program determined value
 Corner rebar fraction top
 Value >= 0; 0 means use program determined value
 Corner rebar fraction bottom
 Value >= 0; 0 means use program determined value
 Consider minimum eccentricity
0 = No
Any other value = Yes
 Consider crack analysis
0 = No
Any other value = Yes
 Crack Width Limit Full Load, a_crc,ult [mm]
 Value >= 0; 0 means use program determined value
 Crack Width Limit Long Term, a_crc,l,ult [mm]
 Value >= 0; 0 means use program determined value
 Longitudinal Rebar Size Top
 Value is the index in the list of the rebar defined in the Reinforcing Bar Sizes form
 Longitudinal Rebar Size Bottom
 Value is the index in the list of the rebar defined in the Reinforcing Bar Sizes form
 Ignore Beneficial Pu for Beam Design
0 = No
Any other value = Yes
 Is Longitudinal Rebar Ribbed
0 = No
Any other value = Yes
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the item is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'create new concrete frame section property
   ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
'set frame section property
   ret = SapModel.FrameObj.SetSection("8", "R1")
'set concrete design code
   ret = SapModel.DesignConcrete.SetCode("SP 63.13330.2012")
'set overwrite item
   ret = SapModel.DesignConcrete.SP63133302011.SetOverwrite("8", 1, 2)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCoSP63133302011 Interface
ETABSv1 Namespace